#+TITLE: Programming Language Interstices
#+SUBTITLE: Bridging Fortran and Python
#+AUTHOR: Rohit Goswami
# I need the footnotes to be inlined
#+STARTUP: fninline
#+EXCLUDE_TAGS: noexport

#+BEGIN_SRC emacs-lisp :exports none :eval always
(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))
(eval unpackaged/org-export-html-with-useful-ids-mode)
;; Stop using citeproc-org by default
(setq org-export-before-parsing-hook '(org-ref-acronyms-before-parsing org-ref-glossary-before-parsing org-attach-expand-links))
#+END_SRC

#+RESULTS:
| org-ref-acronyms-before-parsing | org-ref-glossary-before-parsing | org-attach-expand-links |


** Numerical Methods 101
$$Ax=b \\
x=A^{-1}b
$$
- Numerical stability issues
- Floating Point Numbers IEEE 754 cite:goldbergWhatEveryComputer1991
- Convergence can be tied to machine epsilon....
  + Or a *magic number* $(1e-5,1e-16)$
  + Or *Chemical/Spectroscopic* accuracy
#+begin_src fortran :exports both
program main
 print*, tiny(0.d0)
end program
#+end_src

#+RESULTS:
: 2.2250738585072014e-308

